SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( KVB-K5210-3H-5
	Comment (
		Created with EngMexx V1.0.2

	)
	Type ( Engine )
	WagonShape ( "KVB-K5210-3H-5.s" )
	Size ( 2.7m 3.8m 13.55m )
	CentreOfGravity ( 0m 1.7m 0m )
	Mass ( 30t )
	WheelRadius ( 0.4m )
	InertiaTensor ( Box ( 2.65m 3.5m 12.86m ) )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingUniqueType ( "Scharfenberg" )
		CouplingHasRigidConnection (  )
		Velocity ( 1m/s )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 3cm )
	DerailRailForce ( 70kN )
	DerailBufferForce ( 40kN )
	NumWheels ( 4 )
	Friction (
		150N/m/s	1	52mph	80000N/m/s	1.2
		0N/rad/s	1	-1rad/s	0N/rad/s	1
	)
	AntiSlip (  )
	BrakeEquipmentType ( "ep_brake" )
	BrakeSystemType ( EP )
	MaxBrakeForce ( 0kN )
	EmergencyBrakeResMaxPressure ( 90 )
	TripleValveRatio ( 1 )
	MaxReleaseRate ( 20 )
	MaxApplicationRate ( 20 )
	MaxAuxilaryChargingRate ( 1 )
	EmergencyResCapacity ( 1 )
	EmergencyResChargingRate ( 1 )
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 50 )
	Inside (
		PassengerCabinFile ( "K5000-Innen.s" )
		PassengerCabinHeadPos ( -0.67m 2.1m 3m )
		RotationLimit ( 25 25 25 )
		StartDirection ( 0 0 0 )
		Sound ( "k5000eng.SMS" )
	)
	PassengerCapacity ( 280 )
	Lights ( 6
		Light (
			comment ( Lichtkegel #1 )
			Type ( 1 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0 3 10 )
					Azimuth ( 0 0 0 )
					Angle ( 20 )
					Transition ( 0 )
					Radius ( 40 )
				)
			)
		)
		Light (
			comment ( Lichtkegel #2 )
			Type ( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFFFFF )
					Position ( 0 3.5 -1 )
					Angle ( 15 )
					Transition ( 0 )
					Radius ( 100 )
				)
			)
		)
		Light (
			comment ( vorn links abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0.6 1 7.47 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		Light (
			comment ( vorn rechts abgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( -0.6 1 7.47 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		Light (
			comment ( vorn links aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFFFFF )
					Position ( 0.6 1 7.47 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 1 )
				)
			)
		)
		Light (
			comment ( vorn rechts aufgeblendet )
			Type ( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFFFFF )
					Position ( -0.6 1 7.47 )
					Azimuth ( 0 0 0 )
					Elevation ( 0 0 0 )
					Transition ( 0 )
					Radius ( 1 )
				)
			)
		)
	)
	Sound ( "k5000eng.SMS" )
)

Engine ( KVB-K5210-3H-5
	Wagon ( "KVB-K5210-3H-5" )
	Type ( Electric )
	MaxPower ( 600kW )
	MaxForce ( 45kN )
	MaxContinuousForce ( 35kN )
	MaxVelocity ( 80km/h )
	MaxCurrent ( 470A )
	WheelRadius ( 0.5m )
	Vigilance ( 0 0 )
	Sanding ( 1mph )
	MaxSandingTime ( -1 )
	NumWheels ( 4 )

	HeadOut ( -1.7m 2.9m 9m )

	AirBrakesAirCompressorPowerRating ( 4 )
	AirBrakesAirCompressorWattage ( 19000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.5 )
	AirBrakesCompressorRestartPressure ( 95 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 1 )
	AirBrakesMainMaxAirPressure ( 100 )
	AirBrakesMainMinResAirPressure ( 30 )
	AirBrakesMainResVolume ( 1 )
	EngineBrakesControllerMaxApplicationRate ( 10 )
	EngineBrakesControllerMaxReleaseRate ( 20 )
	EngineBrakesControllerEmergencyApplicationRate ( 10 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	EngineBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesControllerHasProportionalBrake ( 1 )
	TrainBrakesControllerMinPressureReduction ( 6 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 20 )
	TrainBrakesControllerEmergencyApplicationRate ( 10 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	TrainBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesProportionalBrakeLag ( 0.9 )

	DynamicBrakesMinUsableSpeed ( -87 )
	DynamicBrakesMaximumEffectiveSpeed ( -37 )
	DynamicBrakesMaximumForce ( 40kN )
	DynamicBrakesResistorCurrentLimit ( 500 )
	DynamicBrakesCutInSpeed ( -86 )
	DynamicBrakesFadingSpeed ( 37 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 87 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 2 )
	DynamicBrakeHasAutoBailOff ( 1 )
	BrakesTrainBrakeType ( EP )
	BrakesEngineControllers ( "Train,Dynamic" )
	CabView ( "KVBK5000.cvf" )

	DoesHornTriggerBell ( 0 )

	EmergencyStopMonitor (
		MonitoringDeviceMonitorTimeLimit ( 0 )
		MonitoringDeviceAlarmTimeLimit ( 0 )
		MonitoringDevicePenaltyTimeLimit ( 0 )
		MonitoringDeviceCriticalLevel ( 0 )
		MonitoringDeviceResetLevel ( 0 )
		MonitoringDeviceAppliesFullBrake ( 1 )
		MonitoringDeviceAppliesEmergencyBrake ( 1 )
		MonitoringDeviceAppliesCutsPower ( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnResetButton ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )
	)

	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Brake_Train ( 0 1 0.333333333333333 0
			NumNotches ( 4
				Notch ( 0 0 TrainBrakesControllerReleaseStart )
				Notch ( 0.333333 1 TrainBrakesControllerEPApplyStart )
				Notch ( 0.666666 0 TrainBrakesControllerFullServiceStart )
				Notch ( 0.999999 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Throttle ( 0 1 0.142857142857143 0
			NumNotches ( 8
				Notch ( 0 0 Dummy )
				Notch ( 0.142857 0 Dummy )
				Notch ( 0.285714 0 Dummy )
				Notch ( 0.428571 0 Dummy )
				Notch ( 0.571428 0 Dummy )
				Notch ( 0.714285 0 Dummy )
				Notch ( 0.857142 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.5 0.5 throttle dynamic )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 0 )
		Horn ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
		Wipers ( 0 1 0 )
	)

	Name ( "KVB-K5210-3-Holweide-5" )
	Sound ( "K5000eng.SMS" )

	Description (
		"Im Jahr 1996 beschafften die Kölner Verkehrsbetriebe (KVB AG) eine Serie von 33 Stadtbahnwagen B.\nDiese wurden als 2301 bis 2333 in den Kölner Fuhrpark eingeordnet und stellen eine Weiterentwicklung der schon seit 1988 vorhandenen Wagen der Reihe 2200 dar.\nEs handelt sich dabei um zweiteilige sechsachsige Stadtbahnfahrzeuge mit Drehstromantrieb."
	)
	EngineOperatingProcedures (
		"So setzen Sie den Zug in Bewegung\n1. Drücken Sie die W-TASTE, um den Richtungshebel auf  Vorwärts zu stellen.\nHinweis: Der Richtungshebel kann nur bedient werden, wenn sich der Fahrhebel in der Stellung Leerlauf befindet.\n2. Drücken Sie die D-TASTE, um den Fahrhebel auf Fahrstufe  1 zu stellen.\n3. Wenn Sie schneller fahren möchten, drücken Sie die D-TASTE, um in eine höhere Fahrstufe zu schalten.\nSo bremsen Sie den Zug ab\n1. Drücken Sie die A-TASTE, um den Regler nach unten zu bewegen.\n2. Setzen Sie die Bremsen ein, wenn Sie noch weiter abbremsen möchten.\n3. Drücken Sie die A-TASTE, um den Fahrhebel zur höchsten Bremseinstellung zu bewegen.\nHinweis: Mit dem Fahrhebel wird die elektrische Bremse betätigt. Diese ist so eingestellt, dass der Zug damit bis zum Stillstand abgebremst werden kann.\nDie Druckluftbremse ist für den normalen Fahrbetrieb nicht nötig. Sie wird nur vom Computergesteuerten Gegenverkehr benutzt.\n'So fahren Sie rückwärts\n" +
		"1. Halten Sie den Zug vollständig an.\n" +
		"2. Drücken Sie die S-TASTE, um den Richtungshebel in die Position Rückwärts zu stellen.\n" +
		"Hinweis: Der Richtungshebel kann nur bedient werden, wenn sich der Regler in der Stellung Leerlauf befindet.\n" +
		"3. Schieben Sie den Regler langsam nach vorne (D-TASTE).\n" +
		"So lassen Sie Fahrgäste ein- und aussteigen\n" +
		"1. Halten Sie an einem Bahnhof an.\n" +
		"2. Drücken Sie die EINGABETASTE.\n" +
		"3. Warten Sie auf das 'Signal zur Abfahrt'.\n" +
		"Mit der P-Taste werden einige Türen geöffnet."
	)
)
